In [1]:
import pandas as pd

In [2]:
data = {'Store':['Walmart','Walmart','Costco','Costco','Target','Target'],
       'Customer':['Tim','Jermy','Mark','Denice','Ray','Sam'],
       'Sales':[150,200,550,90,430,120]}
df = pd.DataFrame(data)
df

     Store Customer  Sales
0  Walmart      Tim    150
1  Walmart    Jermy    200
2   Costco     Mark    550
3   Costco   Denice     90
4   Target      Ray    430
5   Target      Sam    120

In [3]:
df.groupby('Store')[['Sales']].sum()

         Sales
Store
Costco     640
Target     550
Walmart    350

In [4]:
df.groupby("Store")[['Sales']].mean()

         Sales
Store
Costco   320.0
Target   275.0
Walmart  175.0

In [5]:
by_store = df.groupby("Store")

In [6]:
by_store

In [7]:
sum1 = by_store.sum()

In [8]:
sum1

           Customer  Sales
Store
Costco   MarkDenice    640
Target       RaySam    550
Walmart    TimJermy    350

In [9]:
sum1['mean'] = mean1['Sales']

sum1

NameError: name 'mean1' is not defined

In [ ]:
df.groupby('Store').mean()

In [11]:
df.groupby('Store').sum()

           Customer  Sales
Store
Costco   MarkDenice    640
Target       RaySam    550
Walmart    TimJermy    350

In [12]:
df.groupby('Store').sum().loc[["Target","Walmart"]]

         Customer  Sales
Store
Target     RaySam    550
Walmart  TimJermy    350

In [13]:
df

     Store Customer  Sales
0  Walmart      Tim    150
1  Walmart    Jermy    200
2   Costco     Mark    550
3   Costco   Denice     90
4   Target      Ray    430
5   Target      Sam    120

In [14]:
by_store.min()

        Customer  Sales
Store
Costco    Denice     90
Target       Ray    120
Walmart    Jermy    150

In [15]:
by_store.max()

        Customer  Sales
Store
Costco      Mark    550
Target       Sam    430
Walmart      Tim    200

In [16]:
by_store[['Sales']].std()

              Sales
Store
Costco   325.269119
Target   219.203102
Walmart   35.355339

In [17]:
by_store.count()

         Customer  Sales
Store
Costco          2      2
Target          2      2
Walmart         2      2

In [18]:
by_store.describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Store
Costco    2.0  320.0  325.269119   90.0  205.0  320.0  435.0  550.0
Target    2.0  275.0  219.203102  120.0  197.5  275.0  352.5  430.0
Walmart   2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0

In [19]:
by_store.describe().transpose()

Store            Costco      Target     Walmart
Sales count    2.000000    2.000000    2.000000
      mean   320.000000  275.000000  175.000000
      std    325.269119  219.203102   35.355339
      min     90.000000  120.000000  150.000000
      25%    205.000000  197.500000  162.500000
      50%    320.000000  275.000000  175.000000
      75%    435.000000  352.500000  187.500000
      max    550.000000  430.000000  200.000000